
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       6 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                            |
|:--------:|:-------------------------------------------------------------------------------------|
|    🟢     | `module.debian-repo-tester.aws_iam_policy.pytest-permissions`                        |
|    🟢     | `module.debian-repo-tester.aws_iam_policy.role-permissions`                          |
|    🟢     | `module.debian-repo-tester.aws_iam_role.role-tester`                                 |
|    🟢     | `module.debian-repo-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢     | `module.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions`          |
|    🟢     | `module.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions`   |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/4a9c895a-1093-4243-a62c-05f86134b54a/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.jumphost-tester-permissions: Reading...
data.aws_iam_policy_document.gha-admin-tester-permissions: Reading...
data.aws_iam_policy_document.omnibus-assume: Reading...
data.aws_iam_policy_document.website-pod-tester-permissions: Reading...
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...
data.aws_iam_policy_document.service-network-tester-permissions: Reading...
data.aws_iam_policy_document.jumphost-tester-permissions: Read complete after 0s [id=1367345401]
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...
data.aws_iam_policy_document.state-bucket-tester-permissions: Reading...
data.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]
data.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]
data.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]
data.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]
data.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=3750070676]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy.read-only-access: Reading...
aws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]
aws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]
module.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Reading...
aws_iam_role.omnibus: Refreshing state... [id=omnibus]
module.debian-repo-tester.data.aws_iam_policy.administrator-access: Reading...
module.github-role-tester.data.aws_iam_policy_document.role-permissions: Reading...
aws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]
module.github-role-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3418751069]
aws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]
aws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]
module.github-role-tester.data.aws_iam_policy.administrator-access: Reading...
module.github-role-tester.data.aws_iam_openid_connect_provider.github: Reading...
module.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]
data.aws_iam_policy_document.pytest-permissions: Reading...
data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...
aws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]
module.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Reading...
module.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
aws_iam_policy.jumphost-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/jumphost-tester-permissions]
module.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]
module.github-role-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy.administrator-access: Reading...
module.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Reading...
aws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]
module.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]
aws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]
module.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Reading...
module.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]
module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
aws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]
module.github-role-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/github-role-tester-permissions20231108005944123200000001]
aws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]
module.debian-repo-tester.data.aws_iam_policy_document.role-trust: Reading...
module.debian-repo-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3736492159]
aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]
module.github-role-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231108003946028700000002]
module.github-role-tester.data.aws_iam_policy_document.role-trust: Reading...
module.github-role-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1596990781]
aws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]
aws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]
aws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]
module.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]
data.aws_iam_policy_document.website-pod-tester-assume: Reading...
data.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]
data.aws_iam_policy_document.gha-admin-tester-assume: Reading...
data.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]
data.aws_iam_policy_document.jumphost-tester-assume: Reading...
data.aws_iam_policy_document.jumphost-tester-assume: Read complete after 0s [id=4147449685]
data.aws_iam_policy_document.service-network-tester-assume: Reading...
data.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]
data.aws_iam_policy_document.state-bucket-tester-assume: Reading...
data.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]
module.github-role-tester.aws_iam_role.role-tester: Refreshing state... [id=github-role-tester]
module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]
module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]
aws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]
aws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]
aws_iam_role.jumphost-tester: Refreshing state... [id=jumphost-tester]
aws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]
aws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]
data.aws_iam_policy_document.omnibus-permissions: Reading...
data.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]
module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]
module.github-role-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=github-role-tester-20231108010822830000000003]
module.github-role-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=github-role-tester-20231108010822771800000001]
aws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]
aws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]
aws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]
aws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]
aws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]
aws_iam_role_policy_attachment.jumphost-tester: Refreshing state... [id=jumphost-tester-20231101163151291300000001]
aws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]
aws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]
module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]
aws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]
aws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]
aws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]
data.aws_iam_policy.read-only-access: Read complete after 4s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]
module.debian-repo-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]
data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.jumphost-tester-admin-permissions: Refreshing state... [id=jumphost-tester-20231101163151292000000002]
aws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]
module.github-role-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.debian-repo-tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "pytest-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.debian-repo-tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "debian-repo-tester-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.debian-repo-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-debian-repo:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-debian-repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "debian-repo-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # module.debian-repo-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "debian-repo-tester"
    }

  # module.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "debian-repo-tester"
    }

  # module.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "debian-repo-tester"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.jumphost-tester-permissions: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Reading...%0Adata.aws_iam_policy_document.omnibus-assume: Reading...%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.jumphost-tester-permissions: Read complete after 0s [id=1367345401]%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=3750070676]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy.read-only-access: Reading...%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Aaws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3418751069]%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Aaws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Adata.aws_iam_policy_document.pytest-permissions: Reading...%0Adata.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...%0Aaws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Aaws_iam_policy.jumphost-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/jumphost-tester-permissions]%0Amodule.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Aaws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Aaws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]%0Amodule.github-role-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/github-role-tester-permissions20231108005944123200000001]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3736492159]%0Aaws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]%0Amodule.github-role-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231108003946028700000002]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1596990781]%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Aaws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]%0Aaws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]%0Adata.aws_iam_policy_document.website-pod-tester-assume: Reading...%0Adata.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]%0Adata.aws_iam_policy_document.jumphost-tester-assume: Reading...%0Adata.aws_iam_policy_document.jumphost-tester-assume: Read complete after 0s [id=4147449685]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]%0Amodule.github-role-tester.aws_iam_role.role-tester: Refreshing state... [id=github-role-tester]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Aaws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]%0Aaws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]%0Aaws_iam_role.jumphost-tester: Refreshing state... [id=jumphost-tester]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Aaws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]%0Adata.aws_iam_policy_document.omnibus-permissions: Reading...%0Adata.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=github-role-tester-20231108010822830000000003]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=github-role-tester-20231108010822771800000001]%0Aaws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]%0Aaws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Aaws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Aaws_iam_role_policy_attachment.jumphost-tester: Refreshing state... [id=jumphost-tester-20231101163151291300000001]%0Aaws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]%0Aaws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]%0Aaws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]%0Aaws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Adata.aws_iam_policy.read-only-access: Read complete after 4s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Adata.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.jumphost-tester-admin-permissions: Refreshing state... [id=jumphost-tester-20231101163151292000000002]%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.debian-repo-tester.aws_iam_policy.pytest-permissions will be created%0A  + resource "aws_iam_policy" "pytest-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "pytest-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutBucketTagging",%0A                          + "s3:GetBucketTagging",%0A                          + "iam:TagRole",%0A                          + "iam:TagPolicy",%0A                          + "ec2:DescribeRegions",%0A                          + "dynamodb:TagResource",%0A                          + "dynamodb:ListTagsOfResource",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.debian-repo-tester.aws_iam_policy.role-permissions will be created%0A  + resource "aws_iam_policy" "role-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "debian-repo-tester-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:GetCallerIdentity"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.debian-repo-tester.aws_iam_role.role-tester will be created%0A  + resource "aws_iam_role" "role-tester" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::990466748045:user/aleks"%0A                        }%0A                    },%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-debian-repo:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to test module infrahouse/terraform-aws-debian-repo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "debian-repo-tester"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.debian-repo-tester.aws_iam_role_policy_attachment.role-admin-permissions[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "debian-repo-tester"%0A    }%0A%0A  # module.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "debian-repo-tester"%0A    }%0A%0A  # module.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "debian-repo-tester"%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC80YTljODk1YS0xMDkzLTQyNDMtYTYyYy0wNWY4NjEzNGI1NGEvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzY3MzQ1NDAxXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwMjg1MDY1NzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODk5NjI5OTUyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEwMTUwOTA3Ml1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzgzNzAwNTE0MF1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNzUwMDcwNjc2XVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZGluZy4uLlxuYXdzX2lhbV9yb2xlLmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sXVxuYXdzX2lhbV9wb2xpY3kuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uc11cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLlxuYXdzX2lhbV9yb2xlLm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXNdXG5tb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3BvbGljeS5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM0MTg3NTEwNjldXG5hd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdXG5hd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXV3MTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi5cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxuYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uXG5hd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seV1cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF1cbmF3c19pYW1fcG9saWN5Lmp1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuY2lfY2RfaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNjc5MDA4Mk9VMFBPUFdPQ1BaNF1cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmF3c19pYW1fcG9saWN5LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvd2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zXVxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdXG5hd3NfaWFtX3BvbGljeS5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zXVxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0Lm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV1cbmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMxMzM4NDE3NzVdXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2dpdGh1Yi1yb2xlLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTA4MDA1OTQ0MTIzMjAwMDAwMDAxXVxuYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQVVOS0FVRU4zMklXS1JTRVpdXG5tb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLlxubW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM3MzY0OTIxNTldXG5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMTA4MDAzOTQ2MDI4NzAwMDAwMDAyXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTk2OTkwNzgxXVxuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiX3Rlc3RfcnVubmVyLTIwMjMwNzAxMTgwMDMxMDg0NzAwMDAwMDAxXVxuYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV1cbmF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdWUxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy1lYXN0LTFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMjc2NDk2MDQ1XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAwNjU3MTczOV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTQ3NDQ5Njg1XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTEwODc4OF1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MjM1ODk1MDldXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyMzU4NzgwNl1cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY4Nzc1MjI3MV1cbmF3c19pYW1fcm9sZS53ZWJzaXRlLXBvZC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlcl1cbmF3c19pYW1fcm9sZS5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXVxuYXdzX2lhbV9yb2xlLmp1bXBob3N0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyXVxuYXdzX2lhbV9yb2xlLnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXJdXG5hd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlcl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mjc0MDY4MjQ4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X2FjbC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUscHVibGljLXJlYWRdXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyLTIwMjMxMTA4MDEwODIyODMwMDAwMDAwMDAzXVxubW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyLTIwMjMxMTA4MDEwODIyNzcxODAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMwODEzMTYyNjIyMjY3MjAwMDAwMDAyXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3Rlci1zZXJuaXZlLW5ldHdvcmstcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMDgxMzE2MjYyMjE3MjkwMDAwMDAwMV1cbmF3c19pYW1fcG9saWN5Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L29tbmlidXMyMDIzMDcyOTA0MjQzMTk5OTIwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlci0yMDIzMTAwOTIwMzEyNDg0MjgwMDAwMDAwMl1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMwNzAzMTk0MjI1Mjg3NjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyLTIwMjMxMTAxMTYzMTUxMjkxMzAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdoYS1hZG1pbi10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXItMjAyMzEwMDkxOTM0MzQ2OTcxMDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2hhLWFkbWluLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NjYxMDAwMDAwMDNdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcG9saWN5LnB1YmxpYy1hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlci0yMDIzMTAxNTE5NTIwMTcwMTUwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyLTIwMjMxMDE1MjAzMDI0MjQ0NDAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXMtMjAyMzA3MjkwNDI0MzIzMjM0MDAwMDAwMDJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTcwNTM5MTI4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViLTIwMjMwOTA4MDA0MTM4NDU5ODAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbl1cbmRhdGEuYXdzX2lhbV9wb2xpY3kucmVhZC1vbmx5LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciA0cyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvUmVhZE9ubHlBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS0yMDIzMDgxMTE4MDYzNTA4NDAwMDAwMDAwMV1cbm1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciA0cyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3QtdGVzdGVyLWFkbWluLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC10ZXN0ZXItMjAyMzExMDExNjMxNTEyOTIwMDAwMDAwMDJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2wtMjAyMzA2MzAwMzA4MDM5NjEyMDAwMDAwMDFdXG5tb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgNHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgNHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLTIwMjMwNzAyMTUyNzQ4NjQ2NDAwMDAwMDAxXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHl0ZXN0LXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwicHl0ZXN0LXBlcm1pc3Npb25zXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dEJ1Y2tldFRhZ2dpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkdldEJ1Y2tldFRhZ2dpbmdcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdSb2xlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUG9saWN5XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVSZWdpb25zXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpUYWdSZXNvdXJjZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6TGlzdFRhZ3NPZlJlc291cmNlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicm9sZS1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSBcImRlYmlhbi1yZXBvLXRlc3Rlci1wZXJtaXNzaW9uc1wiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInN0czpHZXRDYWxsZXJJZGVudGl0eVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwicm9sZS10ZXN0ZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgQVdTID0gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnVzZXIvYWxla3NcIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzoqXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBGZWRlcmF0ZWQgPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbVwiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gdGVzdCBtb2R1bGUgaW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJcbiAgICAgICsgZm9yY2VfZGV0YWNoX3BvbGljaWVzID0gZmFsc2VcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDBcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJkZWJpYW4tcmVwby10ZXN0ZXJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtYWRtaW4tcGVybWlzc2lvbnNbMF0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtYWRtaW4tcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NcIlxuICAgICAgKyByb2xlICAgICAgID0gXCJkZWJpYW4tcmVwby10ZXN0ZXJcIlxuICAgIH1cblxuICAjIG1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImRlYmlhbi1yZXBvLXRlc3RlclwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJkZWJpYW4tcmVwby10ZXN0ZXJcIlxuICAgIH1cblxuUGxhbjogNiB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDAyODUwNjU3Nl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEwMTUwOTA3Ml0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4MzcwMDUxNDBdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM3NTAwNzA2NzZdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFkYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGUuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2xdJTBBYXdzX2lhbV9wb2xpY3kuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uc10lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGUub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9b21uaWJ1c10lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWF3c19pYW1fcG9saWN5LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2doYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM0MTg3NTEwNjldJTBBYXdzX2lhbV91c2VyLnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dHdpbmRiX3Rlc3RfcnVubmVyXSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdXcxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHldJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFhd3NfaWFtX3BvbGljeS5qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2p1bXBob3N0LXRlc3Rlci1wZXJtaXNzaW9uc10lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5jaV9jZF9pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA2NzkwMDgyT1UwUE9QV09DUFo0XSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWF3c19pYW1fcG9saWN5LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvd2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzY3MzQ1NDAxXSUwQWF3c19pYW1fcG9saWN5LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3N0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXQub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQWF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzEzMzg0MTc3NV0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2dpdGh1Yi1yb2xlLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTA4MDA1OTQ0MTIzMjAwMDAwMDAxXSUwQWF3c19pYW1fYWNjZXNzX2tleS50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUFVTktBVUVOMzJJV0tSU0VaXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM3MzY0OTIxNTldJTBBYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTAwOTIwMzEyNDU1NTUwMDAwMDAwMV0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzExMDgwMDM5NDYwMjg3MDAwMDAwMDJdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU5Njk5MDc4MV0lMEFhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXItMjAyMzA3MDExODAwMzEwODQ3MDAwMDAwMDFdJTBBYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV0lMEFhd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXVlMTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtZWFzdC0xXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI3NjQ5NjA0NV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAwNjU3MTczOV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxNDc0NDk2ODVdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1ODUxMDg3ODhdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MjM1ODk1MDldJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlcl0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjM1ODc4MDZdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2ODc3NTIyNzFdJTBBYXdzX2lhbV9yb2xlLndlYnNpdGUtcG9kLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyXSUwQWF3c19pYW1fcm9sZS5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXSUwQWF3c19pYW1fcm9sZS5qdW1waG9zdC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlcl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyNzQwNjgyNDhdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9hY2wub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLHB1YmxpYy1yZWFkXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItcm9sZS10ZXN0ZXItMjAyMzExMDgwMTA4MjI4MzAwMDAwMDAwMDNdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyLTIwMjMxMTA4MDEwODIyNzcxODAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC53ZWJzaXRlLXBvZC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMDgxMzE2MjYyMjI2NzIwMDAwMDAwMl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXNlcm5pdmUtbmV0d29yay1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMwODEzMTYyNjIyMTcyOTAwMDAwMDAxXSUwQWF3c19pYW1fcG9saWN5Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L29tbmlidXMyMDIzMDcyOTA0MjQzMTk5OTIwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NDI4MDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzA3MDMxOTQyMjUyODc2MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyLTIwMjMxMTAxMTYzMTUxMjkxMzAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMDA5MTkzNDM0Njk3MTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTAwOTIwMzEyNDg2NjEwMDAwMDAwM10lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcG9saWN5LnB1YmxpYy1hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUxOTUyMDE3MDE1MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN0YXRlLWJ1Y2tldC10ZXN0ZXItMjAyMzEwMTUyMDMwMjQyNDQ0MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXMtMjAyMzA3MjkwNDI0MzIzMjM0MDAwMDAwMDJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1NzA1MzkxMjhdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViLTIwMjMwOTA4MDA0MTM4NDU5ODAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW5dJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5yZWFkLW9ubHktYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDRzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9SZWFkT25seUFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS0yMDIzMDgxMTE4MDYzNTA4NDAwMDAwMDAwMV0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgNHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3QtdGVzdGVyLWFkbWluLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC10ZXN0ZXItMjAyMzExMDExNjMxNTEyOTIwMDAwMDAwMDJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sLTIwMjMwNjMwMDMwODAzOTYxMjAwMDAwMDAxXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciA0cyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgNHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi0yMDIzMDcwMjE1Mjc0ODY0NjQwMDAwMDAwMV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInB5dGVzdC1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gXCJweXRlc3QtcGVybWlzc2lvbnNcIiUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dEJ1Y2tldFRhZ2dpbmdcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpHZXRCdWNrZXRUYWdnaW5nXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiaWFtOlRhZ1JvbGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUG9saWN5XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZWMyOkRlc2NyaWJlUmVnaW9uc1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlRhZ1Jlc291cmNlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6TGlzdFRhZ3NPZlJlc291cmNlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiZGViaWFuLXJlcG8tdGVzdGVyLXBlcm1pc3Npb25zXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwic3RzOkdldENhbGxlcklkZW50aXR5XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJyb2xlLXRlc3RlclwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBBV1MgPSBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBDb25kaXRpb24gPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0VxdWFscyA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdMaWtlICAgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzoqXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIHRlc3QgbW9kdWxlIGluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiJTBBICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMCUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJkZWJpYW4tcmVwby10ZXN0ZXJcIiUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtYWRtaW4tcGVybWlzc2lvbnNbMF0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLWFkbWluLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NcIiUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiZGViaWFuLXJlcG8tdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicm9sZS1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiZGViaWFuLXJlcG8tdGVzdGVyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJkZWJpYW4tcmVwby10ZXN0ZXJcIiUwQSAgICB9JTBBJTBBUGxhbjogNiB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDYsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>